In [1]:
# Importing Time Series data from csv files

In [2]:
import pandas as pd

In [3]:
temp = pd.read_csv('temp.csv')

In [4]:
# using head() to get top 5 entires
temp.head()

              datetime    LA   NY
0  2013-01-01 00:00:00  11.7 -1.1
1  2013-01-01 01:00:00  10.7 -1.7
2  2013-01-01 02:00:00   9.9 -2.0
3  2013-01-01 03:00:00   9.3 -2.1
4  2013-01-01 04:00:00   8.8 -2.3

In [5]:
# Parsing datetime into separate columns to make the data more meaningful. Click Shift+Tab for options on any Signature.
# read_csv has parse_dates parameter

In [6]:
# This step can be done when data is imported from csv. It makes sense to have datetime information as index of dataframe

In [7]:
temp = pd.read_csv('temp.csv',parse_dates=['datetime'], index_col = 'datetime')

In [8]:
temp.head()

                       LA   NY
datetime
2013-01-01 00:00:00  11.7 -1.1
2013-01-01 01:00:00  10.7 -1.7
2013-01-01 02:00:00   9.9 -2.0
2013-01-01 03:00:00   9.3 -2.1
2013-01-01 04:00:00   8.8 -2.3

In [9]:
# Using info to get information about the dataframe
temp.info()

<class 'pandas.core.frame.DataFrame'>
DatetimeIndex: 35064 entries, 2013-01-01 00:00:00 to 2016-12-31 23:00:00
Data columns (total 2 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   LA      35062 non-null  float64
 1   NY      35064 non-null  float64
dtypes: float64(2)
memory usage: 821.8 KB

In [10]:
# as can be seen datetime datatype changed from object to datetime64

In [11]:
# finding a particular object at a location
temp.iloc[0,0]

11.7

In [12]:
# Checking datatype 
type(temp.iloc[0,0])

numpy.float64

# Converting strings to datetime objects with pd.to_datetime

In [13]:
import pandas as pd

In [14]:
temp = pd.read_csv('temp.csv')

In [15]:
temp.head()

              datetime    LA   NY
0  2013-01-01 00:00:00  11.7 -1.1
1  2013-01-01 01:00:00  10.7 -1.7
2  2013-01-01 02:00:00   9.9 -2.0
3  2013-01-01 03:00:00   9.3 -2.1
4  2013-01-01 04:00:00   8.8 -2.3

In [16]:
temp.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 35064 entries, 0 to 35063
Data columns (total 3 columns):
 #   Column    Non-Null Count  Dtype
---  ------    --------------  -----
 0   datetime  35064 non-null  object
 1   LA        35062 non-null  float64
 2   NY        35064 non-null  float64
dtypes: float64(2), object(1)
memory usage: 821.9+ KB

In [17]:
# Selecting one column from dataframe
temp.datetime

0        2013-01-01 00:00:00
1        2013-01-01 01:00:00
2        2013-01-01 02:00:00
3        2013-01-01 03:00:00
4        2013-01-01 04:00:00
                ...
35059    2016-12-31 19:00:00
35060    2016-12-31 20:00:00
35061    2016-12-31 21:00:00
35062    2016-12-31 22:00:00
35063    2016-12-31 23:00:00
Name: datetime, Length: 35064, dtype: object

In [18]:
temp.datetime[0]

'2013-01-01 00:00:00'

In [19]:
# using pd.to_datetime to transform datetime column from strings to datetime object
pd.to_datetime(temp.datetime)

0       2013-01-01 00:00:00
1       2013-01-01 01:00:00
2       2013-01-01 02:00:00
3       2013-01-01 03:00:00
4       2013-01-01 04:00:00
                ...
35059   2016-12-31 19:00:00
35060   2016-12-31 20:00:00
35061   2016-12-31 21:00:00
35062   2016-12-31 22:00:00
35063   2016-12-31 23:00:00
Name: datetime, Length: 35064, dtype: datetime64[ns]

In [20]:
# Setting datetime column as index using set_index. We need to first apply the pd.to_datetime 
# and pass it through df.set_index. Also drop the datetime column
# In this same step can overwrite our temp dataframe using temp =
temp = temp.set_index(pd.to_datetime(temp.datetime)).drop('datetime', axis = 1)

In [21]:
temp.head()

                       LA   NY
datetime
2013-01-01 00:00:00  11.7 -1.1
2013-01-01 01:00:00  10.7 -1.7
2013-01-01 02:00:00   9.9 -2.0
2013-01-01 03:00:00   9.3 -2.1
2013-01-01 04:00:00   8.8 -2.3

In [22]:
temp.info()

<class 'pandas.core.frame.DataFrame'>
DatetimeIndex: 35064 entries, 2013-01-01 00:00:00 to 2016-12-31 23:00:00
Data columns (total 2 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   LA      35062 non-null  float64
 1   NY      35064 non-null  float64
dtypes: float64(2)
memory usage: 821.8 KB

In [23]:
temp.index # now we will get datetime as index

DatetimeIndex(['2013-01-01 00:00:00', '2013-01-01 01:00:00',
               '2013-01-01 02:00:00', '2013-01-01 03:00:00',
               '2013-01-01 04:00:00', '2013-01-01 05:00:00',
               '2013-01-01 06:00:00', '2013-01-01 07:00:00',
               '2013-01-01 08:00:00', '2013-01-01 09:00:00',
               ...
               '2016-12-31 14:00:00', '2016-12-31 15:00:00',
               '2016-12-31 16:00:00', '2016-12-31 17:00:00',
               '2016-12-31 18:00:00', '2016-12-31 19:00:00',
               '2016-12-31 20:00:00', '2016-12-31 21:00:00',
               '2016-12-31 22:00:00', '2016-12-31 23:00:00'],
              dtype='datetime64[ns]', name='datetime', length=35064, freq=None)

In [24]:
# we can check for a single element as well
temp.index[0]

Timestamp('2013-01-01 00:00:00')

In [25]:
# Pandas is very versatile in handling datetime objects. It can handle yyyy-mm-dd, yyyymdd, yyyy/mm/dd, yyyy mm dd, 
# yyyy-dd-mm, yyyy dd mm, 2015 May 20, May 2015 20, May 20 2015 formats
# uppercase or lowercase letters do not make a difference
# by default pandas assumes time to be midnight. time formats can be hh, hh:mm, hh:mm:ss

In [26]:
pd.to_datetime('2015-06-25 10:30')

Timestamp('2015-06-25 10:30:00')

In [27]:
pd.to_datetime(['may 30 2015', '02-16-2016'])

DatetimeIndex(['2015-05-30', '2016-02-16'], dtype='datetime64[ns]', freq=None)

In [28]:
pd.to_datetime(['may 30 2015', '02-16-2016', 'Apple'], errors = 'coerce')

DatetimeIndex(['2015-05-30', '2016-02-16', 'NaT'], dtype='datetime64[ns]', freq=None)

In [29]:
# We see that apple was changed to NaT which means Not a Time